

import Nav from '../nav'; 
function Home(){

    return (
       <div >
       <Nav />
       <div> 
        <h1>React Router</h1> 
        <p>Маршрутизація на стороні клієнта дозволяє програмі оновлювати URL-адресу після натискання
посилання без повторного запиту на інший документ із сервера. Замість цього ваша програма може
негайно відтворити новий інтерфейс і зробити запити даних за допомогою fetch, щоб оновити
сторінку новою інформацією.</p>  
       </div>
        </div>
        
        );

}
export default Home