// завдання 1. Знайти елемент ul у документі та запам'ятати його у змінній ul.
const ul = document.querySelector('ul');
//------------------------------------------------------------------------------

// завдання 2. За допомогою JSON.parse прочитати елемент localStorage з ключем items та зберегти його в масиві itemsArray.
// Якщо елемент відсутній, створити його зі значенням [].

// Перевіряємо, чи є елемент items в localStorage
if(localStorage.getItem('items')) {
    // Якщо елемент є, зчитуємо його значення і перетворюємо на масив за допомогою JSON.parse
    var itemsArray = JSON.parse(localStorage.getItem('items'));
} else {
    // Якщо елемент відсутній, створюємо порожній масив
    var itemsArray = [];
}
//-------------------------------------------------------------------------------

// завдання 3. Написати функцію addTask(text), що створює елемент li з властивістю textContent, яка дорівнює значенню, що передається за допомогою аргументу функції text.
// Кожний створений елемент li функція повинна додавати до елемента ul.
function addTask(text) {
    // Створюємо новий елемент li
    const newTask = document.createElement('li');
    // Встановлюємо текстовий вміст елемента li рівним значенню text
    newTask.textContent = text;
    // Додаємо створений елемент li до ul
    ul.appendChild(newTask);
}
//-------------------------------------------------------------------------------

// завдання 4. Використовуючи метод forEach та функцію addTask, згенерувати вміст елемента ul, відображаючи його на сторінці.
// Проходимо по масиву елементівArray за допомогою методу forEach
itemsArray.forEach(function(item) {
    // Для кожного елемента масиву викликаємо функцію addTask, передаючи значення елемента
    addTask(item);
});
//-------------------------------------------------------------------------------

// завдання 5. Знайти елемент input у документі та запам'ятати його у змінній input.
const input = document.getElementById('item');
//-------------------------------------------------------------------------------

// завдання 6. Написати функцію add(), що додає до масиву itemsArray значення, введене користувачем в полі input, та зберігає цей масив у localStorage з ключем items, використовуючи метод JSON.stringify.
// Одночасно візуалізувати доданий елемент на сторінці, використовуючи функцію addTask.
function add() {
    // Отримуємо значення, введене користувачем у поле input
    const newItemValue = input.value.trim();

    // Перевіряємо, щоб значення не було порожнім
    if (newItemValue !== '') {
        itemsArray.push(newItemValue); // Додаємо нове значення до масиву itemsArray
        localStorage.setItem('items', JSON.stringify(itemsArray)); // Зберігаємо оновлений масив у localStorage
        addTask(newItemValue); // Візуалізуємо доданий елемент на сторінці
        input.value = ''; // Очищуємо поле input після додавання елемента
    }
}
//-------------------------------------------------------------------------------

// Завдання 7. Написати функцію del(), що чистить localStorage, масив itemsArray та значення властивості ul.innerHTML.
function del() {
    localStorage.removeItem('items'); // Очищуємо localStorage
    itemsArray = []; // Очищуємо масив itemsArray
    ul.innerHTML = ''; // Очищаємо вміст списку на сторінці
}

